Revit 2026 API

# IntersectionResultEdgeObject Property

---

Edge of the face close to the point of intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Edge EdgeObject { get; }
```
```vb
Public ReadOnly Property EdgeObject As Edge
	Get
```
```cpp
public:
property Edge^ EdgeObject {
	Edge^ get ();
}
```
```fsharp
member EdgeObject : Edge with get
```

#### Property Value

Edge

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace